Конфигурация/InformationRegisters/ЖурналСверкиСоСписками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЖурналСверкиСоСписками</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пройдена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнейСверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторПакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РеквизитыСверки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПеречня</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПеречнейОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ЖурналСверкиСоСписками/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокПеречней = Новый СписокЗначений;
	СписокПеречней.Добавить("СписокТеррористов", "Клиенты, сверенные со списком террористов");
	СписокПеречней.Добавить("СписокЛицСЗамороженнымиСчетами", "Клиенты, сверенные со списком лиц с замороженными счетами");
	СписокПеречней.Добавить("СписокОтказников", "Клиенты, сверенные со списоком лиц, которым отказано в операции с ДС, открытии или закрытии депозитного вклада");
	СписокПеречней.Добавить("СанкционныйСписок", "Клиенты, сверенные со списком лиц, в отношении которых вводятся специальные экономические меры");
	СписокПеречней.Добавить("СписокНедействительныхПаспортов", "Клиенты, сверенные со списком недействительных паспортов");
	СписокПеречней.Добавить("СписокДисквалифицированныхЛиц", "Должностные лица, сверенные со списком дисквалифицированных лиц");
	СписокПеречней.Добавить("СанкционныйСписокНедружественныхГосударств", "Клиенты, сверенные с санкционным списком недружественных государств");
	
	ГруппаРодитель = Элементы.ФормаГруппаОтчет;	
	
	Для Каждого Перечень Из СписокПеречней Цикл
		КомандаФормы = ЭтаФорма.Команды.Добавить("КомандаСформироватьОтчет" + Перечень.Значение);
		КомандаФормы.Действие	= "Подключаемый_КомандаСформироватьОтчет";
		
		КнопкаКоманды = Элементы.Добавить("КомандаСформироватьОтчет" + Перечень.Значение, Тип("КнопкаФормы"), ГруппаРодитель);
		КнопкаКоманды.ИмяКоманды = "КомандаСформироватьОтчет" + Перечень.Значение;
		КнопкаКоманды.Заголовок = Перечень.Представление;
	КонецЦикла;
	
	ЗаполнитьКомандыСверкиСПроизвольнымиСписками();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаСформироватьОтчет(Команда)
	КлючПеречня = Сред(Команда.Имя, СтрДлина("КомандаСформироватьОтчет") + 1);
	
	Отчет = СформироватьОтчетНаСервере(КлючПеречня, Элементы[Команда.Имя].Заголовок);
	Если Отчет <> Неопределено Тогда
		Отчет.Показать(Элементы[Команда.Имя].Заголовок);
	КонецЕсли;	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьОтчетНаСервере(КлючПеречня, ЗаголовокОтчета = Неопределено)	
	ВидПеречня	= Справочники.ВидыПеречнейОбъектов[КлючПеречня];
	Организация	= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация"); 
	
	Возврат РегистрыСведений.ЖурналСверкиСоСписками.СформироватьОтчет(Организация, ВидПеречня, ЗаголовокОтчета);
КонецФункции

&НаКлиенте
Процедура РезультатыСверки(Команда)
	ОткрытьФорму("РегистрСведений.ЖурналСверкиСоСписками.Форма.ФормаОтчетаПоРезультатамСверки", , ЭтаФорма, ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКомандыСверкиСПроизвольнымиСписками()
	
	//Пока массив, потом организуем получение списка справочника ВидыПеречнейОбъектов
	ВидыПеречней = Новый Массив;
	ВидыПеречней.Добавить(Справочники.ВидыПеречнейОбъектов.СводныйПереченьСоветаБезопасностиООН);
	
	Для Каждого ВидПеречня Из ВидыПеречней Цикл 
		НоваяКоманда = Команды.Добавить("ВыполнитьСверкуСоСписком" + ВидПеречня.ИмяПредопределенныхДанных);
		НоваяКоманда.Действие  = "Подключаемый_ВыполнитьСверкуСПроизвольнымСписком";
		НоваяКоманда.Заголовок = СтрШаблон("Выполнить сверку со списком %1", ВидПеречня);
		
		НовыйЭлемент = Элементы.Добавить(НоваяКоманда.Имя, Тип("КнопкаФормы"), Элементы.ФормаГруппаСверка);
		НовыйЭлемент.ИмяКоманды = НоваяКоманда.Имя;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьСверкуСПроизвольнымСписком(Команда)
	
	ОтчетОСверке = ВыполнитьСверкуСПроизвольнымСпискомНаСервере(ПредопределенноеЗначение("Справочник.ВидыПеречнейОбъектов." + СтрЗаменить(Команда.Имя, "ВыполнитьСверкуСоСписком", "")));
	
	Если ОтчетОСверке = Неопределено Тогда
		ПоказатьПредупреждение(, "При выполнении сверки прозошли ошибки!");
		Возврат;	
	КонецЕсли;
	
	ОтчетОСверке.Показать("Результат сверки со списком террористов");	
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.ЖурналСверкиСоСписками"));
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьСверкуСПроизвольнымСпискомНаСервере(ВидПеречня)
	
	ОтчетОСверке = Новый ТабличныйДокумент;
	Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	РегистрыСведений.ЖурналСверкиСоСписками.ВыполнитьСверкуСоСписком(Организация,,, ОтчетОСверке, ВидПеречня);

	Возврат ОтчетОСверке;
	
КонецФункции
